"""
    总复习1.0
        自动化内存内存机制
            1. 引用计数：
                每个对象记录被变量绑定(引用)的数量,当为0时被销毁。
            2. 标记清除:
                 扫描内存空间,判断数据是否可用,如果遇到循环引用的问题,
                 会标记为"垃圾".
            3. 分代回收:
                将内存分为小(年轻代)中(中年代)大(老年代)三代
                创建新数据在"年轻代"存储
                如果某一代内存告急,将触发标记清楚,
                将本代可用数据移动到下一代,清空本代数据.

            价值:尽少产生垃圾/自定义对象池/设置垃圾回收器参数

            对象池:每次创建数据时,都会判断池中是否具有可用数据,
                  如果有,则直接返回地址;
                  如果没有,择创建后返回地址,并加入池中.
                  适用性:频繁创建与销毁
"""
list01 = [] # 列表引用计数1
list02 = list01# 列表引用计数2
del list01 # 列表引用计数1
list02 = None # 列表引用计数0  -- 被销毁

list02 = []
list03 = []
list02.append(list03)
list03.append(list02)

# 整数对象池  小数池   字符串池  bool池
data01 = (123,23,434,5,456567)
data02 = (123,23,434,5,456567)
print(id(data01))
print(id(data02))

